{
  "backend/main.mo": "Minimal Motoko actor with no functions defined.",
  "feature_evidence.json": "JSON report listing features, related files, components, test IDs, and confidence metadata.",
  "frontend-file-summaries.txt": "Text file containing auto-generated summaries for all frontend source files.",
  "frontend/index.css": "Global Tailwind base and theme variable definitions for light and dark modes.",
  "frontend/index.html": "Basic HTML entry file mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React app with hero, 3D scene, gift reveal flow, background audio, and content sections.",
  "frontend/src/components/AudioSection.tsx": "Empty component file placeholder.",
  "frontend/src/components/BirthdayScene3D.tsx": "React Three Fiber 3D scene with floating gift boxes, confetti, sparkles, and orbit controls.",
  "frontend/src/components/GiftRevealMessages.tsx": "Expandable gift-card message component revealing birthday messages with animations.",
  "frontend/src/components/PhotosSection.tsx": "Readonly storybook-style photo slider using preloaded images with captions, swipe navigation, and fallback handling.",
  "frontend/src/content/birthdayMessages.ts": "Exports an array of three predefined birthday message strings.",
  "frontend/src/content/preloadedPhotos.ts": "Exports arrays of static Ghibli-style image paths and corresponding story captions for the gallery.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context for Internet Identity authentication, including login, logout, and identity state handling.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file for backend-related React Query hooks; currently unused.",
  "frontend/src/hooks/useSwipe.ts": "Implements a hook to detect swipe gestures and trigger callbacks for four swipe directions.",
  "frontend/src/index.css": "Defines Tailwind base styles and a custom birthday-themed color palette with additional utility classes.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider before rendering App.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, animations, container settings, and plugin integrations.",
  "project_state.json": "Stores the project’s current state, feature requirements, and image specifications for the birthday website."
}