{
  "kind": "build_request",
  "title": "Remove photo upload and replace gallery with 6 Ghibli-style couple images (storybook birthday surprise)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Remove the photo upload option from the existing Photos section so visitors can no longer upload images from their device.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "okay remove the upload photo option and include many ghibi images like me and her"
        ]
      },
      "acceptanceCriteria": [
        "The upload card/CTA (\"Add More Photos\") is no longer rendered in the Photos section UI.",
        "The hidden <input type=\"file\"> and related upload handler logic are removed or unused.",
        "The Photos section no longer imports or renders the Upload icon from lucide-react."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Replace the current preloaded photo list with 6 new static, Ghibli-style couple images (studying on a laptop; biscuits & tea; gym workouts; dancing joyfully; riding a bike together; heart within us) and ensure the slider displays these images.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "1.one image should be both are studing by laptop\n2.eating biscut and tea\n3.doing gym workouts\n4.dancing jollyly\n5riding in bike both together\n6.one image shows heart within us"
        ]
      },
      "acceptanceCriteria": [
        "frontend/src/content/preloadedPhotos.ts is updated to reference exactly 6 image paths under /assets/generated/ for the new Ghibli-style images.",
        "The Photos section initializes its gallery from the updated preloaded photo list and shows the 6 images in the slider with navigation/thumbnails.",
        "No references to the existing WhatsApp preloaded JPEG filenames remain in preloadedPhotos.ts."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Add a cohesive, creative \"Ghibli storybook birthday surprise\" presentation across the Photos section (and its heading) using English user-facing text, while keeping the existing app structure (hero → messages → photos).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "include your cretivity to surprice her like pro birthday surpriser"
        ]
      },
      "acceptanceCriteria": [
        "The Photos section heading in frontend/src/App.tsx is updated to an English, storybook-themed title (not \"Our Memories Together\").",
        "The Photos section includes light storybook-like framing (e.g., caption/chapter feel, gentle decorative styling) without introducing new data entry or upload features.",
        "All new/updated user-facing text is in English."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Add the 6 newly generated images as static frontend assets and reference them directly from the frontend (do not serve images through the backend).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "make ghibli images of us"
        ]
      },
      "acceptanceCriteria": [
        "All 6 new images exist as static files under frontend/public/assets/generated/ with the exact filenames specified in the image requirements.",
        "The app references the images via absolute paths like /assets/generated/<filename>.png.",
        "No backend code is added/required to fetch or serve these images."
      ]
    }
  ],
  "constraints": [
    "Do not modify any files under frontend/src/components/ui (read-only).",
    "Do not edit frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, or frontend/src/main.tsx (immutable paths).",
    "Keep the backend as a single Motoko actor; no new backend services or databases."
  ],
  "nonGoals": [
    "Do not add Internet Identity login or any authentication changes.",
    "Do not add new upload features elsewhere in the app.",
    "Do not add real-time features (chat, websockets) or external API integrations."
  ],
  "imageRequirements": {
    "required": [
      "Ghibli-inspired anime watercolor illustration of a couple studying together with a laptop, cozy indoor lighting, warm pastel palette, soft film grain (ghibli-couple-study-laptop.dim_1920x1080.png)",
      "Ghibli-inspired anime watercolor illustration of a couple sharing biscuits and tea at a small table, warm afternoon light, gentle bokeh, pastel tones (ghibli-couple-biscuits-tea.dim_1920x1080.png)",
      "Ghibli-inspired anime watercolor illustration of a couple doing gym workouts together, playful energetic mood, soft shaded lighting, pastel colors (ghibli-couple-gym-workout.dim_1920x1080.png)",
      "Ghibli-inspired anime watercolor illustration of a couple dancing joyfully, flowing motion, sparkling lights, warm celebratory palette (ghibli-couple-dance-joy.dim_1920x1080.png)",
      "Ghibli-inspired anime watercolor illustration of a couple riding a bicycle together, scenic path, wind-swept hair, lush greenery, warm sunlight (ghibli-couple-bike-together.dim_1920x1080.png)",
      "Ghibli-inspired anime watercolor illustration symbolizing a heart within the couple, gentle glowing heart motif, dreamy background, warm pastel palette (ghibli-couple-heart-within.dim_1920x1080.png)"
    ],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}