{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Replace uploadable photo gallery with static Ghibli-style storybook slider",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Remove the photo upload UI and related upload logic from the Photos section.",
      "acceptanceCriteria": [
        "The upload card/CTA (\"Add More Photos\") is no longer rendered in the Photos section UI.",
        "The hidden <input type=\"file\"> and related upload handler logic are removed or unused.",
        "The Photos section no longer imports or renders the Upload icon from lucide-react."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/PhotosSection.tsx",
          "operation": "modify",
          "description": "Remove the upload card/CTA, hidden file input, and FileReader-based upload handler; remove lucide-react Upload import; ensure empty-state copy no longer suggests uploading. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Update the preloaded gallery to use exactly 6 new generated Ghibli-style couple images and ensure the slider uses them.",
      "acceptanceCriteria": [
        "frontend/src/content/preloadedPhotos.ts is updated to reference exactly 6 image paths under /assets/generated/ for the new Ghibli-style images.",
        "The Photos section initializes its gallery from the updated preloaded photo list and shows the 6 images in the slider with navigation/thumbnails.",
        "No references to the existing WhatsApp preloaded JPEG filenames remain in preloadedPhotos.ts."
      ],
      "file_operations": [
        {
          "path": "frontend/src/content/preloadedPhotos.ts",
          "operation": "modify",
          "description": "Replace the existing WhatsApp JPEG paths with exactly 6 absolute paths pointing to the generated assets: /assets/generated/ghibli-couple-study-laptop.dim_1920x1080.png, /assets/generated/ghibli-couple-biscuits-tea.dim_1920x1080.png, /assets/generated/ghibli-couple-gym-workout.dim_1920x1080.png, /assets/generated/ghibli-couple-dance-joy.dim_1920x1080.png, /assets/generated/ghibli-couple-bike-together.dim_1920x1080.png, /assets/generated/ghibli-couple-heart-within.dim_1920x1080.png. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/PhotosSection.tsx",
          "operation": "modify",
          "description": "Ensure the gallery/slider state is derived from the updated preloadedPhotos list (keeping fallback image behavior) and that navigation + thumbnails correctly cover all 6 images. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Apply an English, storybook-themed 'Ghibli storybook birthday surprise' presentation to the Photos section heading and framing without changing app structure.",
      "acceptanceCriteria": [
        "The Photos section heading in frontend/src/App.tsx is updated to an English, storybook-themed title (not \"Our Memories Together\").",
        "The Photos section includes light storybook-like framing (e.g., caption/chapter feel, gentle decorative styling) without introducing new data entry or upload features.",
        "All new/updated user-facing text is in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Update the Photos section heading text to an English storybook-themed title consistent with a 'Ghibli storybook birthday surprise' (keeping the existing hero → messages → photos structure unchanged). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/PhotosSection.tsx",
          "operation": "modify",
          "description": "Add storybook-like framing around the slider (e.g., chapter-style intro/subtitle and per-slide English captions aligned to the six scenes) while keeping the gallery read-only and removing any data-entry affordances. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Add minimal global styling utilities (via existing Tailwind layers) to support a subtle storybook frame/caption feel used by PhotosSection (no new stylesheet files). Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Add the 6 generated images as static frontend assets under frontend/public and reference them directly via /assets/generated paths.",
      "acceptanceCriteria": [
        "All 6 new images exist as static files under frontend/public/assets/generated/ with the exact filenames specified in the image requirements.",
        "The app references the images via absolute paths like /assets/generated/<filename>.png.",
        "No backend code is added/required to fetch or serve these images."
      ],
      "file_operations": [
        {
          "path": "frontend/public/assets/generated/ghibli-couple-study-laptop.dim_1920x1080.png",
          "operation": "create",
          "description": "Add the generated static image asset to the frontend public folder (study together with a laptop)."
        },
        {
          "path": "frontend/public/assets/generated/ghibli-couple-biscuits-tea.dim_1920x1080.png",
          "operation": "create",
          "description": "Add the generated static image asset to the frontend public folder (sharing biscuits and tea)."
        },
        {
          "path": "frontend/public/assets/generated/ghibli-couple-gym-workout.dim_1920x1080.png",
          "operation": "create",
          "description": "Add the generated static image asset to the frontend public folder (gym workout together)."
        },
        {
          "path": "frontend/public/assets/generated/ghibli-couple-dance-joy.dim_1920x1080.png",
          "operation": "create",
          "description": "Add the generated static image asset to the frontend public folder (dancing joyfully)."
        },
        {
          "path": "frontend/public/assets/generated/ghibli-couple-bike-together.dim_1920x1080.png",
          "operation": "create",
          "description": "Add the generated static image asset to the frontend public folder (riding a bicycle together)."
        },
        {
          "path": "frontend/public/assets/generated/ghibli-couple-heart-within.dim_1920x1080.png",
          "operation": "create",
          "description": "Add the generated static image asset to the frontend public folder (heart within us motif)."
        }
      ]
    }
  ]
}