{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 3,
  "summary": "Build a new birthday-surprise website featuring multiple Ghibli-style images of the user and partner, and remove the prior site's photo upload section.",
  "architectural_notes": [],
  "known_issues": [],
  "isFixRequest": false,
  "imageRequirements": "## Required Images\n- Ghibli-inspired anime watercolor illustration of a couple studying together with a laptop, cozy indoor lighting, warm pastel palette, soft film grain (ghibli-couple-study-laptop.dim_1920x1080.png)\n- Ghibli-inspired anime watercolor illustration of a couple sharing biscuits and tea at a small table, warm afternoon light, gentle bokeh, pastel tones (ghibli-couple-biscuits-tea.dim_1920x1080.png)\n- Ghibli-inspired anime watercolor illustration of a couple doing gym workouts together, playful energetic mood, soft shaded lighting, pastel colors (ghibli-couple-gym-workout.dim_1920x1080.png)\n- Ghibli-inspired anime watercolor illustration of a couple dancing joyfully, flowing motion, sparkling lights, warm celebratory palette (ghibli-couple-dance-joy.dim_1920x1080.png)\n- Ghibli-inspired anime watercolor illustration of a couple riding a bicycle together, scenic path, wind-swept hair, lush greenery, warm sunlight (ghibli-couple-bike-together.dim_1920x1080.png)\n- Ghibli-inspired anime watercolor illustration symbolizing a heart within the couple, gentle glowing heart motif, dreamy background, warm pastel palette (ghibli-couple-heart-within.dim_1920x1080.png)",
  "existing_features": [
    {
      "id": "feature-remove-the-photo-upload-option-from-the-existing-photos-section-so-visitors-can-no-longer-upload-images-from-their-device",
      "title": "Remove the photo upload option from the existing Photos section so visitors can no longer upload images from their device.",
      "reqIds": [
        "REQ-1"
      ],
      "version": 1
    },
    {
      "id": "feature-replace-the-current-preloaded-photo-list-with-6-new-static-ghibli-style-couple-images-studying-on-a-laptop-biscuits-tea-gym-workouts-dancing-joyfully-riding-a-bike-together-heart-within-us-and-ensure-the-slider-displays-these-images",
      "title": "Replace the current preloaded photo list with 6 new static, Ghibli-style couple images (studying on a laptop; biscuits & tea; gym workouts; dancing joyfully; riding a bike together; heart within us) and ensure the slider displays these images.",
      "reqIds": [
        "REQ-2"
      ],
      "version": 1
    },
    {
      "id": "feature-add-a-cohesive-creative-ghibli-storybook-birthday-surprise-presentation-across-the-photos-section-and-its-heading-using-english-user-facing-text-while-keeping-the-existing-app-structure-hero-messages-photos",
      "title": "Add a cohesive, creative \"Ghibli storybook birthday surprise\" presentation across the Photos section (and its heading) using English user-facing text, while keeping the existing app structure (hero → messages → photos).",
      "reqIds": [
        "REQ-3"
      ],
      "version": 1
    },
    {
      "id": "feature-add-the-6-newly-generated-images-as-static-frontend-assets-and-reference-them-directly-from-the-frontend-do-not-serve-images-through-the-backend",
      "title": "Add the 6 newly generated images as static frontend assets and reference them directly from the frontend (do not serve images through the backend).",
      "reqIds": [
        "REQ-4"
      ],
      "version": 1
    }
  ],
  "new_feature_requests": [
    {
      "id": "AR-1",
      "summary": "Remove the photo upload option/section from the existing website",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-2",
      "summary": "Add a set of Ghibli-style couple images (studying on laptop, biscuits & tea, gym workout, dancing, riding bike together, heart-within-us) to the new birthday-surprise website",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-3",
      "summary": "Create a new 'pro' birthday surprise website experience with creative presentation to surprise her",
      "reqIds": [],
      "status": "pending"
    }
  ],
  "gameProjectType": "none",
  "projectName": "Remove photo upload and replace gallery with 6 Ghibli-style couple images (storybook birthday surprise)",
  "clarification_mode": "instant",
  "clarification_rounds": 0
}